---
kind: type
id: T:Autodesk.Revit.DB.Analysis.MEPAnalyticalNode
source: html/d542aa13-f6a7-087c-9660-b0698d303a0c.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalNode

Represents an analytical node of the MEP analytical model.

## Syntax (C#)
```csharp
public class MEPAnalyticalNode : IDisposable
```